Benchmark_files/output_cluster_read_t8_3.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)
 
 Running the test with following options:
 Number of threads: 8
 Initializing random number generator from current time
 
 
 Initializing worker threads...
 
 Threads started!
 
 Latency histogram (values are in milliseconds)
        value  ------------- distribution ------------- count
        1.443 |                                         3
        1.469 |*                                        19
        1.496 |***                                      64
        1.523 |***                                      76
        1.551 |***                                      79
        1.579 |**                                       49
        1.608 |*                                        32
        1.637 |*                                        26
        1.667 |*                                        13
        1.697 |                                         10
        1.728 |                                         4
        1.759 |                                         4
        1.824 |                                         1
        1.891 |                                         1
        1.960 |                                         2
        2.106 |                                         1
        2.223 |                                         1
        2.264 |                                         1
        2.662 |                                         1
        2.861 |                                         1
        3.020 |                                         1
        3.075 |                                         1
        3.130 |                                         1
        3.187 |                                         2
        3.425 |                                         1
        3.551 |                                         1
        3.615 |                                         1
        3.748 |                                         1
        4.329 |                                         1
        4.487 |                                         1
        4.652 |                                         4
        4.737 |                                         2
        4.823 |                                         3
        4.910 |                                         2
        5.090 |                                         4
        5.570 |                                         1
        5.774 |                                         1
        5.879 |                                         1
        6.095 |                                         1
        6.205 |                                         2
        6.318 |                                         5
        6.433 |                                         4
        6.550 |                                         3
        6.669 |                                         3
        6.790 |                                         2
        6.913 |                                         4
        7.039 |                                         2
        7.167 |                                         2
        7.430 |                                         3
        7.565 |                                         1
        7.702 |                                         2
        7.842 |                                         3
        7.985 |                                         4
        8.130 |                                         4
        8.277 |                                         8
        8.428 |                                         2
        8.581 |                                         3
        8.737 |                                         2
        8.895 |                                         1
        9.057 |                                         1
        9.222 |                                         6
        9.389 |                                         6
        9.560 |*                                        20
        9.734 |*                                        19
        9.910 |*                                        18
       10.090 |                                         11
       10.274 |                                         8
       10.460 |*                                        13
       10.651 |*                                        22
       10.844 |***                                      69
       11.041 |****                                     101
       11.242 |****                                     97
       11.446 |****                                     90
       11.654 |***                                      70
       11.866 |**                                       55
       12.081 |********                                 208
       12.301 |***********************                  571
       12.524 |**************************************** 980
       12.752 |***************************************  954
       12.984 |************************                 586
       13.219 |**********                               255
       13.460 |******                                   138
       13.704 |******                                   141
       13.953 |******                                   156
       14.207 |*****                                    116
       14.465 |****                                     106
       14.728 |***                                      65
       14.995 |*                                        36
       15.268 |*                                        30
       15.545 |*                                        28
       15.828 |**                                       37
       16.115 |*                                        20
       16.408 |                                         9
       16.706 |                                         7
       17.010 |                                         11
       17.319 |                                         10
       17.633 |                                         11
       17.954 |                                         5
       18.280 |                                         3
       18.612 |                                         7
       18.950 |                                         7
       19.295 |                                         9
       19.645 |                                         5
       20.002 |                                         8
       20.366 |*                                        19
       20.736 |*                                        19
       21.112 |*                                        19
       21.496 |*                                        26
       21.886 |*                                        34
       22.284 |**                                       39
       22.689 |**                                       46
       23.101 |***                                      70
       23.521 |*****                                    113
       23.948 |****                                     87
       24.384 |*                                        24
       24.827 |*                                        25
       25.278 |                                         9
       25.737 |                                         9
       26.205 |                                         7
       26.681 |                                         6
       27.165 |                                         5
       27.659 |                                         1
       28.673 |                                         3
       33.718 |                                         1
  
 SQL statistics:
     queries performed:
         read:                            86310
         write:                           0
         other:                           12330
         total:                           98640
     transactions:                        6165   (615.45 per sec.)
     queries:                             98640  (9847.14 per sec.)
     ignored errors:                      0      (0.00 per sec.)
     reconnects:                          0      (0.00 per sec.)
 
 General statistics:
     total time:                          10.0147s
     total number of events:              6165
 
 Latency (ms):
          min:                                    1.45
          avg:                                   12.97
          max:                                   33.55
          95th percentile:                       23.10
          sum:                                79987.17
 
 Threads fairness:
     events (avg/stddev):           770.6250/1.80
     execution time (avg/stddev):   9.9984/0.01